docs/mediciones/perf/k6-03-cache-caliente.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  00.5s/40.0s

running (0m02.0s), 01/20 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 01/20 VUs  01.5s/40.0s

running (0m03.0s), 01/20 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 01/20 VUs  02.5s/40.0s

running (0m04.0s), 02/20 VUs, 3 complete and 0 interrupted iterations
default   [   9% ] 02/20 VUs  03.5s/40.0s

running (0m05.0s), 02/20 VUs, 5 complete and 0 interrupted iterations
default   [  11% ] 02/20 VUs  04.5s/40.0s

running (0m06.0s), 03/20 VUs, 7 complete and 0 interrupted iterations
default   [  14% ] 03/20 VUs  05.5s/40.0s

running (0m07.0s), 03/20 VUs, 10 complete and 0 interrupted iterations
default   [  16% ] 03/20 VUs  06.5s/40.0s

running (0m08.0s), 03/20 VUs, 13 complete and 0 interrupted iterations
default   [  19% ] 03/20 VUs  07.5s/40.0s

running (0m09.0s), 04/20 VUs, 16 complete and 0 interrupted iterations
default   [  21% ] 04/20 VUs  08.5s/40.0s

running (0m10.0s), 04/20 VUs, 20 complete and 0 interrupted iterations
default   [  24% ] 04/20 VUs  09.5s/40.0s

running (0m11.0s), 05/20 VUs, 24 complete and 0 interrupted iterations
default   [  26% ] 05/20 VUs  10.5s/40.0s

running (0m12.0s), 06/20 VUs, 29 complete and 0 interrupted iterations
default   [  29% ] 06/20 VUs  11.5s/40.0s

running (0m13.0s), 06/20 VUs, 35 complete and 0 interrupted iterations
default   [  31% ] 06/20 VUs  12.5s/40.0s

running (0m14.0s), 07/20 VUs, 41 complete and 0 interrupted iterations
default   [  34% ] 07/20 VUs  13.5s/40.0s

running (0m15.0s), 08/20 VUs, 48 complete and 0 interrupted iterations
default   [  36% ] 08/20 VUs  14.5s/40.0s

running (0m16.0s), 09/20 VUs, 56 complete and 0 interrupted iterations
default   [  39% ] 09/20 VUs  15.5s/40.0s

running (0m17.0s), 09/20 VUs, 64 complete and 0 interrupted iterations
default   [  41% ] 09/20 VUs  16.5s/40.0s

running (0m18.0s), 10/20 VUs, 72 complete and 0 interrupted iterations
default   [  44% ] 10/20 VUs  17.5s/40.0s

running (0m19.0s), 11/20 VUs, 82 complete and 0 interrupted iterations
default   [  46% ] 11/20 VUs  18.5s/40.0s

running (0m20.0s), 12/20 VUs, 93 complete and 0 interrupted iterations
default   [  49% ] 12/20 VUs  19.5s/40.0s

running (0m21.0s), 12/20 VUs, 104 complete and 0 interrupted iterations
default   [  51% ] 12/20 VUs  20.5s/40.0s

running (0m22.0s), 13/20 VUs, 116 complete and 0 interrupted iterations
default   [  54% ] 13/20 VUs  21.5s/40.0s

running (0m23.0s), 14/20 VUs, 128 complete and 0 interrupted iterations
default   [  56% ] 14/20 VUs  22.5s/40.0s

running (0m24.0s), 15/20 VUs, 142 complete and 0 interrupted iterations
default   [  59% ] 15/20 VUs  23.5s/40.0s

running (0m25.0s), 15/20 VUs, 156 complete and 0 interrupted iterations
default   [  61% ] 15/20 VUs  24.5s/40.0s

running (0m26.0s), 16/20 VUs, 171 complete and 0 interrupted iterations
default   [  64% ] 16/20 VUs  25.5s/40.0s

running (0m27.0s), 17/20 VUs, 187 complete and 0 interrupted iterations
default   [  66% ] 17/20 VUs  26.5s/40.0s

running (0m28.0s), 18/20 VUs, 203 complete and 0 interrupted iterations
default   [  69% ] 18/20 VUs  27.5s/40.0s

running (0m29.0s), 18/20 VUs, 221 complete and 0 interrupted iterations
default   [  71% ] 18/20 VUs  28.5s/40.0s

running (0m30.0s), 19/20 VUs, 238 complete and 0 interrupted iterations
default   [  74% ] 19/20 VUs  29.5s/40.0s

running (0m31.0s), 20/20 VUs, 256 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  30.5s/40.0s

running (0m32.0s), 19/20 VUs, 276 complete and 0 interrupted iterations
default   [  79% ] 19/20 VUs  31.5s/40.0s

running (0m33.0s), 16/20 VUs, 295 complete and 0 interrupted iterations
default   [  81% ] 16/20 VUs  32.5s/40.0s

running (0m34.0s), 15/20 VUs, 311 complete and 0 interrupted iterations
default   [  84% ] 15/20 VUs  33.5s/40.0s

running (0m35.0s), 12/20 VUs, 326 complete and 0 interrupted iterations
default   [  86% ] 12/20 VUs  34.5s/40.0s

running (0m36.0s), 10/20 VUs, 338 complete and 0 interrupted iterations
default   [  89% ] 10/20 VUs  35.5s/40.0s

running (0m37.0s), 09/20 VUs, 347 complete and 0 interrupted iterations
default   [  91% ] 09/20 VUs  36.5s/40.0s

running (0m38.0s), 06/20 VUs, 356 complete and 0 interrupted iterations
default   [  94% ] 06/20 VUs  37.5s/40.0s

running (0m39.0s), 05/20 VUs, 362 complete and 0 interrupted iterations
default   [  96% ] 05/20 VUs  38.5s/40.0s

running (0m40.0s), 02/20 VUs, 367 complete and 0 interrupted iterations
default   [  99% ] 02/20 VUs  39.5s/40.0s


  █ THRESHOLDS 

    catalogo_duracion
    ✓ 'p(95)<200' p(95)=64.89ms

    catalogo_errores
    ✓ 'rate<0.01' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 738     18.192884/s
    checks_succeeded...: 100.00% 738 out of 738
    checks_failed......: 0.00%   0 out of 738

    ✓ catálogo responde 200
    ✓ catálogo devuelve contenido

    CUSTOM
    catalogo_duracion..............: avg=25.61ms min=6.3ms med=17.79ms max=212.33ms p(90)=49.98ms p(95)=64.89ms
    catalogo_errores...............: 0.00%  0 out of 369

    HTTP
    http_req_duration..............: avg=26.94ms min=6.3ms med=17.79ms max=517.4ms  p(90)=50.53ms p(95)=67.22ms
      { expected_response:true }...: avg=26.94ms min=6.3ms med=17.79ms max=517.4ms  p(90)=50.53ms p(95)=67.22ms
    http_req_failed................: 0.00%  0 out of 370
    http_reqs......................: 370    9.121094/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=1s    med=1.01s   max=1.21s    p(90)=1.05s   p(95)=1.06s  
    iterations.....................: 369    9.096442/s
    vus............................: 2      min=1        max=20
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 1.5 MB 36 kB/s
    data_sent......................: 175 kB 4.3 kB/s



running (0m40.6s), 00/20 VUs, 369 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  40s